In [185]:
import time

import numpy as np
import pandas as pd
import yfinance as yfin

yfin.pdr_override()

from datetime import date
from datetime import datetime as dt
from datetime import timedelta

## df.replace() method ##

In [186]:
s = pd.Series([1, 2, 3, 4, 5])  # initialize a series class
print("type of s:", type(s))
print(s)

type of s: <class 'pandas.core.series.Series'>
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [187]:
k = s.replace(2, 22)  # replace all 2 values with 22, returns a new copy of s, does NOT mutate s.
k

0     1
1    22
2     3
3     4
4     5
dtype: int64

In [188]:
s  # s stays the same because inplace=False argument was given as default to above method. s is NOT mutated.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [189]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4, 5, 6, 7],
                   'B': [5, 6, 7, 8, 9, 10, 11, 12],
                   'C': ['a', 'b', 'c', 'd', 'e', 1, 2, 3]})
df

   A   B  C
0  0   5  a
1  1   6  b
2  2   7  c
3  3   8  d
4  4   9  e
5  5  10  1
6  6  11  2
7  7  12  3

In [190]:
df.replace((5, 6), (55, 66))  # replace values 5 -> 55 and 6 -> 66. We can use 2 arraylike as values for to_replace and value arguments.

    A   B  C
0   0  55  a
1   1  66  b
2   2   7  c
3   3   8  d
4   4   9  e
5  55  10  1
6  66  11  2
7   7  12  3

In [191]:
# We can also use a dict in the first argument (to_replace) to specify which columns to look for to replace values
df.replace({"A":5, "B":6}, 100)  # replace the 5 values of A and 6 values of B to 100.

     A    B  C
0    0    5  a
1    1  100  b
2    2    7  c
3    3    8  d
4    4    9  e
5  100   10  1
6    6   11  2
7    7   12  3

In [192]:
df.replace(5, {"A":55, "B":555})  # Replace the values of 5 to 55 if in column A, to 555 if in column B

    A    B  C
0   0  555  a
1   1    6  b
2   2    7  c
3   3    8  d
4   4    9  e
5  55   10  1
6   6   11  2
7   7   12  3

In [193]:
df.replace({0:100, 5:500})   # if we pass dict as the first argument it is in the form of  to_be_replaced : replacing_value

     A    B  C
0  100  500  a
1    1    6  b
2    2    7  c
3    3    8  d
4    4    9  e
5  500   10  1
6    6   11  2
7    7   12  3

In [194]:
df["A"].replace({0:100, 5:500})  # we can also handle cols separately

0    100
1      1
2      2
3      3
4      4
5    500
6      6
7      7
Name: A, dtype: int64

## df.astype() method ##

In [195]:
# pd.df.astype() method:
print(df)  # our original dataframe

   A   B  C
0  0   5  a
1  1   6  b
2  2   7  c
3  3   8  d
4  4   9  e
5  5  10  1
6  6  11  2
7  7  12  3

In [196]:
df.dtypes  # values in columns A and B are type int64, values in column C is type object

A     int64
B     int64
C    object
dtype: object

In [197]:
# We can cast the types of values in individual columns using df.astype(). Returns a copy of df as default (does not mutate).
df_cast = df.astype({"A":"float64", "B":str})
df_cast

     A   B  C
0  0.0   5  a
1  1.0   6  b
2  2.0   7  c
3  3.0   8  d
4  4.0   9  e
5  5.0  10  1
6  6.0  11  2
7  7.0  12  3

In [198]:
df_cast.dtypes  # column A turned to float. And also because we cast the values in B to string, column B turned to object.

A    float64
B     object
C     object
dtype: object

## pandas.to_datetime ##

In [199]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [200]:
df_datetime = pd.to_datetime(df)  # whole dataframe converted to datetime
df_datetime

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [201]:
mydf = pd.DataFrame({
    "A":["2019-01-01", "2020-01-01", "2021-01-01"],
    "B":[100, 110, 80]
})

mydf

            A    B
0  2019-01-01  100
1  2020-01-01  110
2  2021-01-01   80

In [202]:
mydf.dtypes

A    object
B     int64
dtype: object

In [203]:
mydf = pd.to_datetime(mydf.A, yearfirst=True)
mydf

0   2019-01-01
1   2020-01-01
2   2021-01-01
Name: A, dtype: datetime64[ns]

## pandas.Series.dt.strftime()  ##

In [204]:
# Generate 3 timestamps with 1 second frequency

rng = pd.date_range(pd.Timestamp("2018-03-10 09:00"),
                    periods=3, freq='s')
rng

DatetimeIndex(['2018-03-10 09:00:00', '2018-03-10 09:00:01',
               '2018-03-10 09:00:02'],
              dtype='datetime64[ns]', freq='S')

In [205]:
rng.strftime('%B %d, %Y, %r')

Index(['March 10, 2018, 09:00:00 AM', 'March 10, 2018, 09:00:01 AM',
       'March 10, 2018, 09:00:02 AM'],
      dtype='object')

## pandas.DataFrame.values ##
We recommend using **DataFrame.to_numpy()** instead.

In [206]:
df = pd.DataFrame({'age':    [ 3,  29],
                   'height': [94, 170],
                   'weight': [31, 115]})
df

   age  height  weight
0    3      94      31
1   29     170     115

In [207]:
df_np = df.to_numpy()  # converts the dataframe to numpy array (notice column names and indexes are gone)
df_np

array([[  3,  94,  31],
       [ 29, 170, 115]])

## pandas.Series.tolist() ##

In [208]:
s = pd.Series(["a", "b", "c"], (0, 1, 2))  # first argument is values, second argument is indexes
s

0    a
1    b
2    c
dtype: object

In [209]:
s_list = s.tolist()  # notice indexes are gone.
s_list

['a', 'b', 'c']

## 1. The Risk Adjusted Discount Rate ##

We discount cash flows using risk-free interest rate:

$$\text{Bond price} = \frac{\text{ECF}_1}{1+i} + \frac{\text{ECF}_2}{(1+i)^2} + \frac{\text{ECF}_3}{(1+i)^3}$$

$\text{ECF}$ = Expected Cash Flow  <br>
$i$ = interest rate  <br>

## 2. Estimating Expected Cash Flows
The first step in valuing the bond is to find the expected cash flow at each period. This is done by adding the product of the default payout and the probability of default ($p$) with the product of the promised payment (coupon payments and repayment of principal) and the probability of not defaulting ($1-p$), which is also referred to as the probability of survival. \
Let's say our bond has 3 cash flows: 2 coupon payments and one principal payment at the end:

_________________________

$\text{ECF}_1 = p\ (\text{Default Payout}) + (1-p)\ (\text{Coupon Payment})$

with probability $p$ the borrower defaults on the first payment and pays the default payout or w.p. $(1-p)$ the borrower does **not** default and pays the coupon value.

------------------

$\text{ECF}_2 = (1-p)\ \big( p\ (\text{Default Payout}) + (1-p)\ (\text{Coupon Payment}) \big)$

------------------

$\text{ECF}_3 = (1-p)^2\ \big( p\ (\text{Default Payout}) + (1-p)\ (\text{Coupon Payment} + \text{Principal}) \big)$

--------------------------------

$\text{ECF}$ = Expected Cash Flow  <br>
$p = \text{Probability of Default}$ <br>
$\text{Default Payout} = \text{Principal} \times \text{Recovery Rate}$

## 3. Expected Risk Premium

$$r_{_m} = r_{_f} + \beta \cdot \text{MRP}$$

$r_{_m}$ = Market Rate of Return  <br>
$r_{_f}$ = Risk-free Rate  <br>
$\beta$ = Beta  <br>
$\text{MRP}$ = Market Risk Premium  <br>

In [210]:
# Ten-Year Risk-free Rate
timespan = 100
current_date = date.today()
past_date = current_date - timedelta(days=timespan)
ten_year_risk_free_rate_df = yfin.download("^TNX", past_date, current_date)
ten_year_risk_free_rate_df

[*********************100%%**********************]  1 of 1 completed

             Open   High    Low  Close  Adj Close  Volume
Date
2023-06-27  3.714  3.776  3.692  3.768      3.768       0
2023-06-28  3.735  3.766  3.704  3.710      3.710       0
2023-06-29  3.747  3.868  3.747  3.854      3.854       0
2023-06-30  3.860  3.872  3.807  3.819      3.819       0
2023-07-03  3.864  3.866  3.778  3.858      3.858       0
...           ...    ...    ...    ...        ...     ...
2023-09-28  4.624  4.688  4.597  4.597      4.597       0
2023-09-29  4.549  4.575  4.508  4.573      4.573       0
2023-10-02  4.631  4.703  4.627  4.683      4.683       0
2023-10-03  4.737  4.806  4.695  4.802      4.802       0
2023-10-04  4.756  4.794  4.727  4.735      4.735       0

[70 rows x 6 columns]

In [211]:
ten_year_risk_free_rate = ten_year_risk_free_rate_df.iloc[-1, 4] / 100
ten_year_risk_free_rate

0.04735000133514404

The market risk premium should be the expected return on the market index (such as S&P 500) less the expected return (or yield) on the long-term government bond. For our purposes, we use the annual [market risk premium](http://pages.stern.nyu.edu/~adamodar/New_Home_Page/datafile/ctryprem.html) provided by Aswath Damodaran, a professor at the Stern School of Business at New York University.

MRP $= E[r_S] - E[r_B] = \mu_S - i$

where

MRP $:$ Market Risk Premium

$E[r_S] = \mu_S:$ Expected rate of return of a market index such as *S&P 500*

$E[r_B] = i:$ Expected rate of return of the bond which is equal to $i: $ risk-free interest rate

$r_{S} = r_{B} + \beta \cdot \text{MRP}$

According to asset pricing theory, beta represents the type of risk, systematic risk, that cannot be diversified away. By definition, the market itself has a beta of 1. As a result, beta will be equal to 1 when calculating the market rate of return.

In [212]:
# Market Risk Premium
MRP = 0.0472

# Market Equity Beta
beta = 1

# Market Rate of Return
market_rate_of_return = ten_year_risk_free_rate + (beta * MRP)
market_rate_of_return

0.09455000133514405

Now that we have calculated the market rate of return, we can determine the expected risk premium by subtracting the risk-free rate from the market rate of return and multiplying the result by the beta for the bond.

In [213]:
# One-Year Risk-free Rate
one_year_risk_free_rate = (1 + ten_year_risk_free_rate) ** (1 / 10) - 1
one_year_risk_free_rate

0.0046370344987618495

A bond's beta is the sensitivity of that bond's return to the return of the market index. It is a measure of undiversifiable, systematic risk. As you see below, it can be calculated in (at least) two ways.

In [214]:
# Vanguard Short-Term Corporate Bond Index Fund ETF Shares
bond_fund_ticker = "VCSH"

# Download data for the bond fund and the market
market_data = yfin.download("SPY", past_date, current_date)  # the market S&P 500
fund_data = yfin.download("VCSH", past_date, current_date)  # the bond fund VCSH

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

## Capital Asset Pricing Model (CAPM) ##

**CAPM** relates the expected rate of return and volatility of a **risky asset** $T$ to the expected rate of return and volatility of a **market portfolio** $S$. \
\
According to **CAPM**, $\mu_T$ and $\sigma_T$ of an arbitrary asset or portfolio depends only on the asset's correlation to market portfolio $\rho_{ST}$

Consider the financial asset $T$, which has a non-zero correlation to the market portfolio $S$. \
The expected rate of return of the asset $T$ is: \
\
$\mu_T = i + \Large\frac{(\mu_S - i) \cdot \rho_{ST}}{\sigma_S} \cdot \normalsize \sigma_T$

The *covariance* between $T$ and $S$ is defined as $\sigma_{ST} = \rho_{ST} \cdot \sigma_S \cdot \sigma_T$ \
\
then, \
\
$\large\mu_T = i + \Large\frac{(\mu_S - i) \cdot \sigma_{ST}}{\sigma_S ^2} \large = i + \beta_T \cdot (\mu_S - i) $ \
\
where, \
\
$\beta_T \equiv \Large\frac{\sigma_{ST}}{\sigma_S ^2} $ and $\sigma_{ST}$ is the **covariance** between $S$ and $T$ \
\
$(\mu_S - i) :$ Excess return of the market portfolio.

With the expected risk premium now in hand, we revisit the (risk-adjusted) discount rate equation:

**_Discount Rate = Risk-free Rate  + Expected Risk Premium_**

The final input required for the risk-adjusted discount rate is the risk-free interest rate, which we define next.

*Estimating the Risk-Free Rate*<br>
We will again use a one-year risk-free rate so that it matches the duration we want for the risk-adjusted discount rate, which we will use to discount expected cash flows to determine the probability of default.

Expected Risk Premium = (Market Rate of Return - Risk-free Rate of Return) * Beta

In [215]:
# Vanguard Short-Term Corporate Bond Index Fund ETF Shares
bond_fund_ticker = "VCSH"

# Look at 10 years of data
current_date = dt.today()
past_date = dt.today() - timedelta(365 * 10)
# Download data for the bond fund and the market
market_data = yfin.download("SPY", past_date, current_date)  # the market S&P 500
fund_data = yfin.download("VCSH", past_date, current_date)  # the bond fund VCSH

fund_data.head()  # first few rows of the bond fund data

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close  Volume
Date
2013-10-07  79.610001  79.620003  79.510002  79.540001  63.339527  333400
2013-10-08  79.500000  79.550003  79.459999  79.500000  63.307667  484900
2013-10-09  79.570000  79.580002  79.480003  79.500000  63.307667  448500
2013-10-10  79.500000  79.589996  79.449997  79.580002  63.371380  550400
2013-10-11  79.570000  79.650002  79.519997  79.650002  63.427132  536400

In [216]:
market_data  # first few rows of the SP500 data

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2013-10-07,167.419998,168.449997,167.250000,167.429993,139.549744,96295000
2013-10-08,167.399994,167.619995,165.360001,165.479996,137.924515,178015000
2013-10-09,165.800003,166.199997,164.529999,165.600006,138.024521,168973000
2013-10-10,167.289993,169.259995,167.229996,169.169998,141.000000,195955000
2013-10-11,168.910004,170.320007,168.770004,170.259995,141.908508,105040000
...,...,...,...,...,...,...
2023-09-28,425.480011,430.250000,424.869995,428.519989,428.519989,92258300
2023-09-29,431.670013,431.850006,425.910004,427.480011,427.480011,115078500
2023-10-02,426.619995,428.600006,424.459991,427.309998,427.309998,83798600
2023-10-03,425.059998,427.369995,420.179993,421.589996,421.589996,103760600
2023-10-04,422.070007,425.429993,420.559998,424.660004,424.660004,87372400

### Calculate risk-adjusted discounted rate for VCSH bond, assuming SPY as market portfolio (my method) :

$ d_T = 2i + \Large\frac{\sigma_{ST}^2}{\sigma_S^2} \small (\mu_S - i) $

where

$d_T:$ Risk-adjusted discounted rate of asset T

$i:$ Risk-free interest rate

$\Large\frac{\sigma_{ST}^2}{\sigma_S^2} = \beta:$ Beta value of the asset $T$ against market portfolio $S$

$\sigma_S^2:$ Variance of market portfolio $S$

$\mu_S:$ Expected rate of return of market portfolio $S$

In [217]:
# First get pct change as returns dataframes
market_data = market_data["Adj Close"].pct_change()
fund_data = fund_data["Adj Close"].pct_change()

# Mutate dataframes to drop NaN values
market_data.dropna(inplace=True)
fund_data.dropna(inplace=True)

i = one_year_risk_free_rate  # assign the ANNUAL risk free rate
cov_ST = fund_data.cov(market_data)  # covariance between the asset and market portfolio
var_S = market_data.var()  # variance of market portfolio

# Calculate beta
beta = cov_ST / var_S
beta

0.04403428528810737

In [218]:
# Calculate expected ANNUAL rate of return for the market portfolio S (SP500)
mu_S = market_data.mean() * 365
mu_S

0.18381630809253316

In [219]:
# Finally, calculate risk-adjusted discount rate for the bond
d = i + beta * (mu_S - i)
d

0.012527065749905818

In [220]:
# Also calculate expected risk premium for the bond. ERP = (mu_S - i) * beta_T
ERP = (mu_S - i) * beta
ERP

0.007890031251143969

In [221]:
# Then this bond should have an annual interest rate of:
i_bond = i + ERP
i_bond  # same as mu_T and d

0.012527065749905818